/************************************************************************************
*  Copyright (c), 2004-2019, 北京中嵌凌云电子有限公司
*            All rights reserved.
*
* http:  www.embedarm.com
* Email: embedarm@126.com
*
* File name: bkp.h
* Project  : STM32F1XX/4XX系列模块驱动库
* Processor: STM32F1XX/4XX
* Compiler : RealView MDK-ARM Compiler
* 
* Author:  EmbedARM
* Version: 1.10
* Date:    2018.10.1			
* Email:   EmbedARM@126.com
* 
* Description: 本文件是备份寄存器(BKP)硬件驱动程序头文件;
*
* Others: none;
*
* Function List: 
*          1. void BKP_Init(void);
*          2. INT32S BKP_Write(INT8U id, INT16U *p, INT16U len);
*          3. INT32S BKP_Read(INT8U id, INT16U *p, INT16U len);
*		
* History:
*   1. Author:       EmbedARM  
*	   Version: 	 0.90
*	   Date:         2012.1.1
*      Modification: none
*
*************************************************************************************/
#ifndef __BKP_H 
#define __BKP_H 

/************************************************************************************/
// 命令控制函数参数定义
/************************************************************************************/
#include "const.h"

/*************************************************************************************/
//
// 					 BKP硬件驱动函数定义
//
/*************************************************************************************/
/***********************************************************************************
* Function: BKP_Init;
*
* Description: 备份寄存器初始化函数;
*              
* Input:  none;
*
* Output: none;
*
* Return: none;
*
* Note:   none;
************************************************************************************/
void BKP_Init(void);

/***********************************************************************************
* Function: BKP_Write;
*
* Description: 备份寄存器写数据函数;
*              
* Input:  addr, 备份SRAM(寄存器)起始地址; 
*         *p, 写入数据存储的地址指针; 
*         len,要写入数据长度;
*
* Output: none;
*
* Return: ERR_TRUE, 操作成功; 其它值, 参见const.h中错误代码;
*
* Note:   该寄存器在不掉电或掉电有RTC备用电池情况下复位系统数据不会丢失;
*         STM32F10X系列, addr/addr+len范围: 1~42; STM32F40X系列, addr/addr+len范围: 0~2047; 
*         为增加写入速度, 本函数不再做参数范围检查, 请千万不要超过参数范围
************************************************************************************/
INT32S BKP_Write(INT16U addr, INT16U *p, INT16U len);
		   
/***********************************************************************************
* Function: BKP_Read;
*
* Description: 备份寄存器读数据函数;
*              
* Input:  addr, 备份SRAM(寄存器)起始地址;
*         *p, 读出数据存储的地址指针; 
*         len,要读出数据长度;
*
* Output: none;
*
* Return: ERR_TRUE, 操作成功; 其它值, 参见const.h中错误代码;
*
* Note:   该寄存器在不掉电或掉电有RTC备用电池情况下复位系统数据不会丢失;
*         STM32F10X系列, addr/addr+len范围: 1~42; STM32F40X系列, addr/addr+len范围: 0~2047; 
*         为增加读出速度, 本函数不再做参数范围检查, 请千万不要超过参数范围
************************************************************************************/
INT32S BKP_Read(INT16U addr, INT16U *p, INT16U len);
									
#endif
/***********************************************************************************/
// 文件结束
/***********************************************************************************/


