/************************************************************************************
*  Copyright (c), 2004-2019, 北京中嵌凌云电子有限公司
*            All rights reserved.
*
* http:  www.embedarm.com
* Email: embedarm@126.com
*
* File name: delay.h
* Project  : STM32F107VC/103VE/103ZE/407VE模块软件
* Processor: STM32F107VC/103VE/103ZE/407VE
* Compiler : RealView MDK-ARM Compiler
* 
* Author:  EmbedARM
* Version: 1.00
* Date:    2018.10.1			
* Email:   EmbedARM@126.com
* 
* Description: 本文件是延时函数头文件;
*
* Others: none;
*
* Function List: 
*          1. void Delay_us(INT16U val);
*          2. void Delay_ms(INT16U val);
*          3. void Delay_s(INT16U val);
*		
* History:
*   1. Author:       EmbedARM  
*	   Version: 	 0.90
*	   Date:         2012.1.1
*      Modification: none
*
*************************************************************************************/
#ifndef  __DELAY_H
#define  __DELAY_H

/************************************************************************************/
// 引用外部头文件
/************************************************************************************/
#include "const.h"  

/************************************************************************************/
// 常量及全局变量定义
/************************************************************************************/

/************************************************************************************
//
//                 延时函数
//
*************************************************************************************/

/***********************************************************************************
* Function: Delay_us;
*
* Description: 延时程序, 延时时间范围: 0~65535us;
*
* Input:  val, 延时时间变量;
*
* Output: none;
*
* Return: none;
*
* Note:   强烈建议大于1000us(1ms)延时,请使用Delay_ms;
************************************************************************************/
void Delay_us(INT16U val);

/***********************************************************************************
* Function: Delay_ms;
*
* Description: 延时程序, 延时时间范围: 0~65535ms;
*              
* Input:  val, 延时时间变量;
*
* Output: none;
*
* Return: none;
*
* Note:   none;
************************************************************************************/
void Delay_ms(INT16U val);

/***********************************************************************************
* Function: Delay_s;
*
* Description: 延时程序, 延时时间范围: 0~65535s;
*              
* Input:  val, 延时时间变量;
*
* Output: none;
*
* Return: none;
*
* Note:   延时时间最大是65535s
************************************************************************************/
void Delay_s(INT16U val);

#endif
/***********************************************************************************/
// 文件结束
/***********************************************************************************/

