/************************************************************************************
*  Copyright (c), 2004-2019, 北京中嵌凌云电子有限公司
*            All rights reserved.
*
* http:  www.embedarm.com
* Email: embedarm@126.com
*
* File name: iwdg.h
* Project  : STM32F1XX/4XX系列模块驱动库
* Processor: STM32F1XX/4XX
* Compiler : RealView MDK-ARM Compiler
* 
* Author:  EmbedARM
* Version: 1.10
* Date:    2018.10.1			
* Email:   EmbedARM@126.com
* 
* Description:  本文件是独立看门狗(IWDG)硬件驱动程序头文件;
*
* Others: none;
*
* Function List: 
*          1. void IWDG_Init(INT32U t);
*          2. void IWDG_Ctrl(INT8U Cmd);
*		
* History:
*   1. Author:       EmbedARM  
*	   Version: 	 0.90
*	   Date:         2012.1.1
*      Modification: none
*
*************************************************************************************/
#ifndef __IWDG_H 
#define __IWDG_H 
/************************************************************************************/
// 引用外部头文件
/************************************************************************************/
#include "const.h"
/************************************************************************************/
// 命令控制函数参数定义
/************************************************************************************/
// IWDG_Ctrl()函数命令参数定义
#define CMD_IWDG_ENA       0   // 打开看门狗
#define CMD_IWDG_CLEAR     1   // 清除看门狗定时器, 即喂狗

/*************************************************************************************/
//
// 					 IWDG硬件驱动函数定义
//
/*************************************************************************************/

/***********************************************************************************
* Function: IWDG_Init;
*
* Description: IWDG看门狗初始化;
*              
* Input:  t, 看门狗定时时间, 单位：ms, 范围: 10~26000ms
*
* Output: none;
*
* Return: none;
*
* Note:   (1) 由于看门狗时间是按40KHZ频率时钟计算，但实际时钟频率会在30~60KHZ之间，
*             所以用户要知晓看门狗时间误差很大，应用时注意
*         (2) 调用完该函数, 看门狗没有启动, 只有调用完IWDG_Ctrl(CMD_IWDOG_ENA)后看门狗才开始工作
************************************************************************************/
void IWDG_Init(INT32U t);

/***********************************************************************************
* Function: IWDG_Ctrl;
*
* Description: IWDG控制函数;
*              
* Input:  Cmd, 控制参数：CMD_IWDG_ENA:   打开看门狗
*                        CMD_IWDG_CLEAR: 清除看门狗定时器, 即喂狗;
*
* Output: none;
*
* Return: none;
*
* Note:   一旦使能看门狗, 就不能再关闭;
************************************************************************************/
void IWDG_Ctrl(INT8U Cmd);

#endif
/***********************************************************************************/
// 文件结束
/***********************************************************************************/




